<net name="SSD_GoogleNet_v2" version="2" batch="1">
    <layers>
        <layer name="data" type="Input" precision="FP32" id="0">
            <output>
                <port id="0">
                    <dim>1</dim>
                    <dim>3</dim>
                    <dim>300</dim>
                    <dim>300</dim>
                </port>
            </output>
        </layer>
        <layer name="conv1_7x7_s2" type="Convolution" precision="FP32" id="1">
            <convolution_data stride-x="2" stride-y="2" pad-x="3" pad-y="3" kernel-x="7" kernel-y="7" output="64" group="1"/>
            <input>
                <port id="1">
                    <dim>1</dim>
                    <dim>3</dim>
                    <dim>300</dim>
                    <dim>300</dim>
                </port>
            </input>
            <output>
                <port id="2">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>150</dim>
                    <dim>150</dim>
                </port>
            </output>
            <weights offset="0" size="37632"/>
            <biases offset="37632" size="256"/>
        </layer>
        <layer name="conv1_7x7_s2_bn_sc_relu" type="ReLU" precision="FP32" id="4">
            <input>
                <port id="7">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>150</dim>
                    <dim>150</dim>
                </port>
            </input>
            <output>
                <port id="8">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>150</dim>
                    <dim>150</dim>
                </port>
            </output>
        </layer>
        <layer name="pool1_3x3_s2" type="Pooling" precision="FP32" id="5">
            <pooling_data kernel-x="3" kernel-y="3" pad-x="0" pad-y="0" stride-x="2" stride-y="2" rounding-type="ceil" pool-method="max"/>
            <input>
                <port id="9">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>150</dim>
                    <dim>150</dim>
                </port>
            </input>
            <output>
                <port id="10">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
        </layer>
        <layer name="conv2_3x3_reduce" type="Convolution" precision="FP32" id="6">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="64" group="1"/>
            <input>
                <port id="11">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="12">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
            <weights offset="37888" size="16384"/>
            <biases offset="54272" size="256"/>
        </layer>
        <layer name="conv2_3x3_reduce_bn_sc_relu" type="ReLU" precision="FP32" id="9">
            <input>
                <port id="17">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="18">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
        </layer>
        <layer name="conv2_3x3" type="Convolution" precision="FP32" id="10">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="192" group="1"/>
            <input>
                <port id="19">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="20">
                    <dim>1</dim>
                    <dim>192</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
            <weights offset="54528" size="442368"/>
            <biases offset="496896" size="768"/>
        </layer>
        <layer name="conv2_3x3_bn_sc_relu" type="ReLU" precision="FP32" id="13">
            <input>
                <port id="25">
                    <dim>1</dim>
                    <dim>192</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="26">
                    <dim>1</dim>
                    <dim>192</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </output>
        </layer>
        <layer name="pool2_3x3_s2" type="Pooling" precision="FP32" id="14">
            <pooling_data kernel-x="3" kernel-y="3" pad-x="0" pad-y="0" stride-x="2" stride-y="2" rounding-type="ceil" pool-method="max"/>
            <input>
                <port id="27">
                    <dim>1</dim>
                    <dim>192</dim>
                    <dim>75</dim>
                    <dim>75</dim>
                </port>
            </input>
            <output>
                <port id="28">
                    <dim>1</dim>
                    <dim>192</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
        </layer>
        <layer name="inception_3a_pool" type="Pooling" precision="FP32" id="39">
            <pooling_data kernel-x="3" kernel-y="3" pad-x="1" pad-y="1" stride-x="1" stride-y="1" rounding-type="ceil" pool-method="avg"/>
            <input>
                <port id="77">
                    <dim>1</dim>
                    <dim>192</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="78">
                    <dim>1</dim>
                    <dim>192</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
        </layer>
        <layer name="inception_3a_pool_proj" type="Convolution" precision="FP32" id="40">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="32" group="1"/>
            <input>
                <port id="79">
                    <dim>1</dim>
                    <dim>192</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="80">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
            <weights offset="1347328" size="24576"/>
            <biases offset="1371904" size="128"/>
        </layer>
        <layer name="inception_3a_pool_proj_bn_sc_relu" type="ReLU" precision="FP32" id="43">
            <input>
                <port id="85">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="86">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
        </layer>
        <layer name="inception_3a_double3x3_reduce" type="Convolution" precision="FP32" id="27">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="64" group="1"/>
            <input>
                <port id="53">
                    <dim>1</dim>
                    <dim>192</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="54">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
            <weights offset="744192" size="49152"/>
            <biases offset="793344" size="256"/>
        </layer>
        <layer name="inception_3a_double3x3_reduce_bn_sc_relu" type="ReLU" precision="FP32" id="30">
            <input>
                <port id="59">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="60">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
        </layer>
        <layer name="inception_3a_double3x3a" type="Convolution" precision="FP32" id="31">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="96" group="1"/>
            <input>
                <port id="61">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="62">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
            <weights offset="793600" size="221184"/>
            <biases offset="1014784" size="384"/>
        </layer>
        <layer name="inception_3a_double3x3a_bn_sc_relu" type="ReLU" precision="FP32" id="34">
            <input>
                <port id="67">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="68">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
        </layer>
        <layer name="inception_3a_double3x3b" type="Convolution" precision="FP32" id="35">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="96" group="1"/>
            <input>
                <port id="69">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="70">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
            <weights offset="1015168" size="331776"/>
            <biases offset="1346944" size="384"/>
        </layer>
        <layer name="inception_3a_double3x3b_bn_sc_relu" type="ReLU" precision="FP32" id="38">
            <input>
                <port id="75">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="76">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
        </layer>
        <layer name="inception_3a_3x3_reduce" type="Convolution" precision="FP32" id="19">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="64" group="1"/>
            <input>
                <port id="37">
                    <dim>1</dim>
                    <dim>192</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="38">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
            <weights offset="547072" size="49152"/>
            <biases offset="596224" size="256"/>
        </layer>
        <layer name="inception_3a_3x3_reduce_bn_sc_relu" type="ReLU" precision="FP32" id="22">
            <input>
                <port id="43">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="44">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
        </layer>
        <layer name="inception_3a_3x3" type="Convolution" precision="FP32" id="23">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="64" group="1"/>
            <input>
                <port id="45">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="46">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
            <weights offset="596480" size="147456"/>
            <biases offset="743936" size="256"/>
        </layer>
        <layer name="inception_3a_3x3_bn_sc_relu" type="ReLU" precision="FP32" id="26">
            <input>
                <port id="51">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="52">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
        </layer>
        <layer name="inception_3a_1x1" type="Convolution" precision="FP32" id="15">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="64" group="1"/>
            <input>
                <port id="29">
                    <dim>1</dim>
                    <dim>192</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="30">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
            <weights offset="497664" size="49152"/>
            <biases offset="546816" size="256"/>
        </layer>
        <layer name="inception_3a_1x1_bn_sc_relu" type="ReLU" precision="FP32" id="18">
            <input>
                <port id="35">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="36">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
        </layer>
        <layer name="inception_3a_output" type="Concat" precision="FP32" id="44">
            <concat_data axis="1"/>
            <input>
                <port id="87">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
                <port id="88">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
                <port id="89">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
                <port id="90">
                    <dim>1</dim>
                    <dim>32</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="91">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
        </layer>
        <layer name="inception_3b_pool" type="Pooling" precision="FP32" id="69">
            <pooling_data kernel-x="3" kernel-y="3" pad-x="1" pad-y="1" stride-x="1" stride-y="1" rounding-type="ceil" pool-method="avg"/>
            <input>
                <port id="140">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="141">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
        </layer>
        <layer name="inception_3b_pool_proj" type="Convolution" precision="FP32" id="70">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="64" group="1"/>
            <input>
                <port id="142">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="143">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
            <weights offset="2344704" size="65536"/>
            <biases offset="2410240" size="256"/>
        </layer>
        <layer name="inception_3b_pool_proj_bn_sc_relu" type="ReLU" precision="FP32" id="73">
            <input>
                <port id="148">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="149">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
        </layer>
        <layer name="inception_3b_double3x3_reduce" type="Convolution" precision="FP32" id="57">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="64" group="1"/>
            <input>
                <port id="116">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="117">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
            <weights offset="1725184" size="65536"/>
            <biases offset="1790720" size="256"/>
        </layer>
        <layer name="inception_3b_double3x3_reduce_bn_sc_relu" type="ReLU" precision="FP32" id="60">
            <input>
                <port id="122">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="123">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
        </layer>
        <layer name="inception_3b_double3x3a" type="Convolution" precision="FP32" id="61">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="96" group="1"/>
            <input>
                <port id="124">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="125">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
            <weights offset="1790976" size="221184"/>
            <biases offset="2012160" size="384"/>
        </layer>
        <layer name="inception_3b_double3x3a_bn_sc_relu" type="ReLU" precision="FP32" id="64">
            <input>
                <port id="130">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="131">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
        </layer>
        <layer name="inception_3b_double3x3b" type="Convolution" precision="FP32" id="65">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="96" group="1"/>
            <input>
                <port id="132">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="133">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
            <weights offset="2012544" size="331776"/>
            <biases offset="2344320" size="384"/>
        </layer>
        <layer name="inception_3b_double3x3b_bn_sc_relu" type="ReLU" precision="FP32" id="68">
            <input>
                <port id="138">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="139">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
        </layer>
        <layer name="inception_3b_3x3_reduce" type="Convolution" precision="FP32" id="49">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="64" group="1"/>
            <input>
                <port id="100">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="101">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
            <weights offset="1437824" size="65536"/>
            <biases offset="1503360" size="256"/>
        </layer>
        <layer name="inception_3b_3x3_reduce_bn_sc_relu" type="ReLU" precision="FP32" id="52">
            <input>
                <port id="106">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="107">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
        </layer>
        <layer name="inception_3b_3x3" type="Convolution" precision="FP32" id="53">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="96" group="1"/>
            <input>
                <port id="108">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="109">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
            <weights offset="1503616" size="221184"/>
            <biases offset="1724800" size="384"/>
        </layer>
        <layer name="inception_3b_3x3_bn_sc_relu" type="ReLU" precision="FP32" id="56">
            <input>
                <port id="114">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="115">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
        </layer>
        <layer name="inception_3b_1x1" type="Convolution" precision="FP32" id="45">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="64" group="1"/>
            <input>
                <port id="92">
                    <dim>1</dim>
                    <dim>256</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="93">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
            <weights offset="1372032" size="65536"/>
            <biases offset="1437568" size="256"/>
        </layer>
        <layer name="inception_3b_1x1_bn_sc_relu" type="ReLU" precision="FP32" id="48">
            <input>
                <port id="98">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="99">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
        </layer>
        <layer name="inception_3b_output" type="Concat" precision="FP32" id="74">
            <concat_data axis="1"/>
            <input>
                <port id="150">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
                <port id="151">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
                <port id="152">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
                <port id="153">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="154">
                    <dim>1</dim>
                    <dim>320</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
        </layer>
        <layer name="conv4_3_norm_mbox_priorbox" type="PriorBox" precision="FP32" id="261">
            <data min_size="30.000000" max_size="60.000000" aspect_ratio="2.000000" flip="1" clip="0" variance="0.100000,0.100000,0.200000,0.200000" img_size="0" img_h="0" img_w="0" step="8.000000" step_h="0.000000" step_w="0.000000" offset="0.500000"/>
            <input>
                <port id="543">
                    <dim>1</dim>
                    <dim>320</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
                <port id="544">
                    <dim>1</dim>
                    <dim>3</dim>
                    <dim>300</dim>
                    <dim>300</dim>
                </port>
            </input>
            <output>
                <port id="545">
                    <dim>1</dim>
                    <dim>2</dim>
                    <dim>21904</dim>
                </port>
            </output>
        </layer>
        <layer name="conv4_3_norm_mbox_conf" type="Convolution" precision="FP32" id="258">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="84" group="1"/>
            <input>
                <port id="537">
                    <dim>1</dim>
                    <dim>320</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="538">
                    <dim>1</dim>
                    <dim>84</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
            <weights offset="32369216" size="967680"/>
            <biases offset="33336896" size="336"/>
        </layer>
        <layer name="conv4_3_norm_mbox_conf_perm" type="Permute" precision="FP32" id="259">
            <data order="0,2,3,1"/>
            <input>
                <port id="539">
                    <dim>1</dim>
                    <dim>84</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="540">
                    <dim>1</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                    <dim>84</dim>
                </port>
            </output>
        </layer>
        <layer name="conv4_3_norm_mbox_conf_flat" type="Flatten" precision="FP32" id="260">
            <data axis="1" end_axis="-1"/>
            <input>
                <port id="541">
                    <dim>1</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                    <dim>84</dim>
                </port>
            </input>
            <output>
                <port id="542">
                    <dim>1</dim>
                    <dim>114996</dim>
                </port>
            </output>
        </layer>
        <layer name="conv4_3_norm_mbox_loc" type="Convolution" precision="FP32" id="255">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="16" group="1"/>
            <input>
                <port id="531">
                    <dim>1</dim>
                    <dim>320</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="532">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
            <weights offset="32184832" size="184320"/>
            <biases offset="32369152" size="64"/>
        </layer>
        <layer name="conv4_3_norm_mbox_loc_perm" type="Permute" precision="FP32" id="256">
            <data order="0,2,3,1"/>
            <input>
                <port id="533">
                    <dim>1</dim>
                    <dim>16</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="534">
                    <dim>1</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                    <dim>16</dim>
                </port>
            </output>
        </layer>
        <layer name="conv4_3_norm_mbox_loc_flat" type="Flatten" precision="FP32" id="257">
            <data axis="1" end_axis="-1"/>
            <input>
                <port id="535">
                    <dim>1</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                    <dim>16</dim>
                </port>
            </input>
            <output>
                <port id="536">
                    <dim>1</dim>
                    <dim>21904</dim>
                </port>
            </output>
        </layer>
        <layer name="inception_3c_pool" type="Pooling" precision="FP32" id="95">
            <pooling_data kernel-x="3" kernel-y="3" pad-x="0" pad-y="0" stride-x="2" stride-y="2" rounding-type="ceil" pool-method="max"/>
            <input>
                <port id="195">
                    <dim>1</dim>
                    <dim>320</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="196">
                    <dim>1</dim>
                    <dim>320</dim>
                    <dim>18</dim>
                    <dim>18</dim>
                </port>
            </output>
        </layer>
        <layer name="inception_3c_double3x3_reduce" type="Convolution" precision="FP32" id="83">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="64" group="1"/>
            <input>
                <port id="171">
                    <dim>1</dim>
                    <dim>320</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="172">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
            <weights offset="3312768" size="81920"/>
            <biases offset="3394688" size="256"/>
        </layer>
        <layer name="inception_3c_double3x3_reduce_bn_sc_relu" type="ReLU" precision="FP32" id="86">
            <input>
                <port id="177">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="178">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
        </layer>
        <layer name="inception_3c_double3x3a" type="Convolution" precision="FP32" id="87">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="96" group="1"/>
            <input>
                <port id="179">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="180">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
            <weights offset="3394944" size="221184"/>
            <biases offset="3616128" size="384"/>
        </layer>
        <layer name="inception_3c_double3x3a_bn_sc_relu" type="ReLU" precision="FP32" id="90">
            <input>
                <port id="185">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="186">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
        </layer>
        <layer name="inception_3c_double3x3b" type="Convolution" precision="FP32" id="91">
            <convolution_data stride-x="2" stride-y="2" pad-x="0" pad-y="0" kernel-x="3" kernel-y="3" output="96" group="1"/>
            <input>
                <port id="187">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="188">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>18</dim>
                    <dim>18</dim>
                </port>
            </output>
            <weights offset="3616512" size="331776"/>
            <biases offset="3948288" size="384"/>
        </layer>
        <layer name="inception_3c_double3x3b_bn_sc_relu" type="ReLU" precision="FP32" id="94">
            <input>
                <port id="193">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>18</dim>
                    <dim>18</dim>
                </port>
            </input>
            <output>
                <port id="194">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>18</dim>
                    <dim>18</dim>
                </port>
            </output>
        </layer>
        <layer name="inception_3c_3x3_reduce" type="Convolution" precision="FP32" id="75">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="128" group="1"/>
            <input>
                <port id="155">
                    <dim>1</dim>
                    <dim>320</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="156">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
            <weights offset="2410496" size="163840"/>
            <biases offset="2574336" size="512"/>
        </layer>
        <layer name="inception_3c_3x3_reduce_bn_sc_relu" type="ReLU" precision="FP32" id="78">
            <input>
                <port id="161">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="162">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </output>
        </layer>
        <layer name="inception_3c_3x3" type="Convolution" precision="FP32" id="79">
            <convolution_data stride-x="2" stride-y="2" pad-x="0" pad-y="0" kernel-x="3" kernel-y="3" output="160" group="1"/>
            <input>
                <port id="163">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>37</dim>
                    <dim>37</dim>
                </port>
            </input>
            <output>
                <port id="164">
                    <dim>1</dim>
                    <dim>160</dim>
                    <dim>18</dim>
                    <dim>18</dim>
                </port>
            </output>
            <weights offset="2574848" size="737280"/>
            <biases offset="3312128" size="640"/>
        </layer>
        <layer name="inception_3c_3x3_bn_sc_relu" type="ReLU" precision="FP32" id="82">
            <input>
                <port id="169">
                    <dim>1</dim>
                    <dim>160</dim>
                    <dim>18</dim>
                    <dim>18</dim>
                </port>
            </input>
            <output>
                <port id="170">
                    <dim>1</dim>
                    <dim>160</dim>
                    <dim>18</dim>
                    <dim>18</dim>
                </port>
            </output>
        </layer>
        <layer name="inception_3c_output" type="Concat" precision="FP32" id="96">
            <concat_data axis="1"/>
            <input>
                <port id="197">
                    <dim>1</dim>
                    <dim>160</dim>
                    <dim>18</dim>
                    <dim>18</dim>
                </port>
                <port id="198">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>18</dim>
                    <dim>18</dim>
                </port>
                <port id="199">
                    <dim>1</dim>
                    <dim>320</dim>
                    <dim>18</dim>
                    <dim>18</dim>
                </port>
            </input>
            <output>
                <port id="200">
                    <dim>1</dim>
                    <dim>576</dim>
                    <dim>18</dim>
                    <dim>18</dim>
                </port>
            </output>
        </layer>
        <layer name="inception_4a_pool" type="Pooling" precision="FP32" id="121">
            <pooling_data kernel-x="3" kernel-y="3" pad-x="1" pad-y="1" stride-x="1" stride-y="1" rounding-type="ceil" pool-method="avg"/>
            <input>
                <port id="249">
                    <dim>1</dim>
                    <dim>576</dim>
                    <dim>18</dim>
                    <dim>18</dim>
                </port>
            </input>
            <output>
                <port id="250">
                    <dim>1</dim>
                    <dim>576</dim>
                    <dim>18</dim>
                    <dim>18</dim>
                </port>
            </output>
        </layer>
        <layer name="inception_4a_pool_proj" type="Convolution" precision="FP32" id="122">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="128" group="1"/>
            <input>
                <port id="251">
                    <dim>1</dim>
                    <dim>576</dim>
                    <dim>18</dim>
                    <dim>18</dim>
                </port>
            </input>
            <output>
                <port id="252">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>18</dim>
                    <dim>18</dim>
                </port>
            </output>
            <weights offset="6089728" size="294912"/>
            <biases offset="6384640" size="512"/>
        </layer>
        <layer name="inception_4a_pool_proj_bn_sc_relu" type="ReLU" precision="FP32" id="125">
            <input>
                <port id="257">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>18</dim>
                    <dim>18</dim>
                </port>
            </input>
            <output>
                <port id="258">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>18</dim>
                    <dim>18</dim>
                </port>
            </output>
        </layer>
        <layer name="inception_4a_double3x3_reduce" type="Convolution" precision="FP32" id="109">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="96" group="1"/>
            <input>
                <port id="225">
                    <dim>1</dim>
                    <dim>576</dim>
                    <dim>18</dim>
                    <dim>18</dim>
                </port>
            </input>
            <output>
                <port id="226">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>18</dim>
                    <dim>18</dim>
                </port>
            </output>
            <weights offset="4834944" size="221184"/>
            <biases offset="5056128" size="384"/>
        </layer>
        <layer name="inception_4a_double3x3_reduce_bn_sc_relu" type="ReLU" precision="FP32" id="112">
            <input>
                <port id="231">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>18</dim>
                    <dim>18</dim>
                </port>
            </input>
            <output>
                <port id="232">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>18</dim>
                    <dim>18</dim>
                </port>
            </output>
        </layer>
        <layer name="inception_4a_double3x3a" type="Convolution" precision="FP32" id="113">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="128" group="1"/>
            <input>
                <port id="233">
                    <dim>1</dim>
                    <dim>96</dim>
                    <dim>18</dim>
                    <dim>18</dim>
                </port>
            </input>
            <output>
                <port id="234">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>18</dim>
                    <dim>18</dim>
                </port>
            </output>
            <weights offset="5056512" size="442368"/>
            <biases offset="5498880" size="512"/>
        </layer>
        <layer name="inception_4a_double3x3a_bn_sc_relu" type="ReLU" precision="FP32" id="116">
            <input>
                <port id="239">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>18</dim>
                    <dim>18</dim>
                </port>
            </input>
            <output>
                <port id="240">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>18</dim>
                    <dim>18</dim>
                </port>
            </output>
        </layer>
        <layer name="inception_4a_double3x3b" type="Convolution" precision="FP32" id="117">
            <convolution_data stride-x="1" stride-y="1" pad-x="1" pad-y="1" kernel-x="3" kernel-y="3" output="128" group="1"/>
            <input>
                <port id="241">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>18</dim>
                    <dim>18</dim>
                </port>
            </input>
            <output>
                <port id="242">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>18</dim>
                    <dim>18</dim>
                </port>
            </output>
            <weights offset="5499392" size="589824"/>
            <biases offset="6089216" size="512"/>
        </layer>
        <layer name="inception_4a_double3x3b_bn_sc_relu" type="ReLU" precision="FP32" id="120">
            <input>
                <port id="247">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>18</dim>
                    <dim>18</dim>
                </port>
            </input>
            <output>
                <port id="248">
                    <dim>1</dim>
                    <dim>128</dim>
                    <dim>18</dim>
                    <dim>18</dim>
                </port>
            </output>
        </layer>
        <layer name="inception_4a_3x3_reduce" type="Convolution" precision="FP32" id="101">
            <convolution_data stride-x="1" stride-y="1" pad-x="0" pad-y="0" kernel-x="1" kernel-y="1" output="64" group="1"/>
            <input>
                <port id="209">
                    <dim>1</dim>
                    <dim>576</dim>
                    <dim>18</dim>
                    <dim>18</dim>
                </port>
            </input>
            <output>
                <port id="210">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>18</dim>
                    <dim>18</dim>
                </port>
            </output>
            <weights offset="4465664" size="147456"/>
            <biases offset="4613120" size="256"/>
        </layer>
        <layer name="inception_4a_3x3_reduce_bn_sc_relu" type="ReLU" precision="FP32" id="104">
            <input>
                <port id="215">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>18</dim>
                    <dim>18</dim>
                </port>
            </input>
            <output>
                <port id="216">
                    <dim>1</dim>
                    <dim>64</dim>
                    <dim>18</dim>
                    <dim>18</dim>
